#include <stdio.h>	
#include <math.h>

int main() {
    int a, b, y;
    double x;
    int is_correct = 0;

    // Цикл перевірки допустимості вхідних параметрів 
    while (is_correct == 0) {
        printf("Введіть цілі значення a, b та y: ");
        scanf("%d %d %d", &a, &b, &y);

        // Перевірка на від'ємне число під коренем
        if ((a - b * b) < 0) {
            printf("для заданих значень a та b у обчислюваному виразі виконується корінь з від'ємного числа (a-b^2 < 0). Задайте інші значення\n");
        } 
        else if ((a * b) < 0) {
            printf("для заданих значень a та b у обчислюваному виразі виконується корінь з від'ємного числа (ab < 0). Задайте інші значення\n");
        } 
        else {
            // Якщо умови виконані, виходимо з циклу
            is_correct = 1;
        }
    }

    // Обчислення за формулою з файлу
    x = sqrt(a - b * b) + sqrt(a * b) + (double)y / 2;

    printf("Результат: x = %.2f\n", x);

    return 0;
}
